config.org
#+TITLE: Fr33macs, my Nix flake Emacs config
#+AUTHOR: fr33zing
#+PROPERTY: header-args :tangle yes
#+OPTIONS: num:nil H:5 toc:2
#+EXPORT_FILE_NAME: index.html

* About

This is my Emacs configuration. *If you want to try it for yourself, [[*Try it yourself][click here]].*

** Tangling

This file is not tangled using ~org-babel-table~. Instead, it's
tangled using a bare-bones implementation in [[file:util/tangle.py][~util/tangle.py~]], and
thus no fancy tangle features are supported. The ~header-args~
property at the top of the file is not even parsed, it's only there to
maintain compatibility with other tangle implementations.

** Substitution

The function ~getnix~ is used to get a variable from the Nix flake,
sort of like ~getenv~ but not exactly. It isn't actually a function
that exists. Instead, [[file:util/substitute.py][~util/substitute.py~]] is used to substitute all
instances of ~(getnix "variableName")~ with the appropriate Elisp
literal.

** Tags in comments

While reading this document you may see what look to be XML tags,
e.g.:

#+BEGIN_SRC emacs-lisp :tangle no
(defun something-spanning-multiple-src-blocks ()
  (beginning-of-the-defun))
;; <defun>
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  (middle-of-the-defun)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  (end-of-the-defun)) ; <-- closes the defun
;; </defun>
#+END_SRC

These tags are not parsed. They are only used to indicate to the
reader that code in the same scope may be spread across multiple src
blocks.

* Try it yourself
** Warning

Back up your ~.emacs.d~ directory if you already have a configuration
you care about. I don't /think/ that this will affect it, but back it
up anyway just to be safe.

** Instructions

If you don't have Nix installed, [[https://nixos.org/download.html][click here]].

If you have the experimental features [[https://nixos.wiki/wiki/Nix_command][nix-command]] and [[https://nixos.wiki/wiki/Flakes][flakes]] enabled:

#+BEGIN_SRC shell :tangle no
nix run github:fr33zing/fr33macs
#+END_SRC

If you don't have them enabled but you want to enable them, [[https://nixos.wiki/wiki/Flakes#Enable_flakes][click here]].

#+BEGIN_SRC shell :tangle no
nix --experimental-features 'nix-command flakes' run github:fr33zing/fr33macs
#+END_SRC

* Basic setup

Disable unwanted UI elements and startup messages.

#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-message t
      use-dialog-box nil)
#+END_SRC

Enable some things which should probably be default.

#+BEGIN_SRC emacs-lisp
(setq require-final-newline t)
(setq frame-inhibit-implied-resize t)
(global-hl-line-mode)
#+END_SRC

Enable relative line numbers globally.

#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode)
#+END_SRC

* Theme

#+BEGIN_SRC emacs-lisp
(add-to-list 'custom-theme-load-path (getnix "themeDir"))
(load-theme 'catppuccin t)
(setq catppuccin-flavor (getnix "themeVariant"))
(catppuccin-reload)
#+END_SRC

** Variable definitions

#+BEGIN_SRC emacs-lisp
(defvar my:cursor-color (catppuccin-get-color 'sapphire)
  "Default cursor color.")

(defvar my:switch-window-cursor-color (catppuccin-get-color 'red)
  "Cursor color when switching windows.")

(defvar my:code-color (catppuccin-get-color 'text)
  "Default color for text that is considered code.")
#+END_SRC

** Customization

#+BEGIN_SRC emacs-lisp
(set-face-attribute 'default t :font (getnix "font"))

(set-cursor-color my:cursor-color)
(set-face-attribute 'region nil
                    :background (catppuccin-get-color 'surface2))
#+END_SRC

* Libraries
** Dash

Dash is a library for dealing with lists.

#+BEGIN_SRC emacs-lisp
(use-package dash :ensure t)
#+END_SRC

** Map

Map provides generic map-manipulation functions that work on alists,
plists, hash-tables, and arrays.

#+BEGIN_SRC emacs-lisp
(use-package map)
#+END_SRC

