index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-06 Thu 20:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fr33macs, my Nix flake Emacs config</title>
<meta name="author" content="fr33zing" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<h1 class="title">Fr33macs, my Nix flake Emacs config</h1>
<p class="author">by fr33zing</p>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd4e0831">About</a>
<ul>
<li><a href="#orgd6dade7">Tangling</a></li>
<li><a href="#org114669d">Substitution</a></li>
<li><a href="#orgfc9220d">Tags in comments</a></li>
</ul>
</li>
<li><a href="#org93065cc">Try it yourself</a>
<ul>
<li><a href="#org2cad4ed">Warning</a></li>
<li><a href="#orga7c30c9">Instructions</a></li>
</ul>
</li>
<li><a href="#orgc2a9f28">Basic setup</a></li>
<li><a href="#org6ffc75c">Theme</a>
<ul>
<li><a href="#org944b0c2">Variable definitions</a></li>
<li><a href="#orga217aaa">Customization</a></li>
</ul>
</li>
<li><a href="#orgbf4849d">Libraries</a>
<ul>
<li><a href="#orgf5ab9f5">Dash</a></li>
<li><a href="#org47bcd98">Map</a></li>
<li><a href="#orgd7fd7e7">Subr-x</a></li>
</ul>
</li>
<li><a href="#orgd6a6d1c">My library</a>
<ul>
<li><a href="#org984c1c9">Advice</a></li>
<li><a href="#orgb1a26a8">Timing</a></li>
<li><a href="#org74287ef">Windows</a></li>
</ul>
</li>
<li><a href="#org82673f9">Backups</a></li>
<li><a href="#org6f535ef">Key bindings</a>
<ul>
<li><a href="#org17ac5ee">Hydras</a></li>
<li><a href="#org29fc501">General</a></li>
<li><a href="#org567491b">Which-key</a></li>
</ul>
</li>
<li><a href="#orgbd34cd5">Evil</a></li>
<li><a href="#orgf9ff19d">Minibuffer</a>
<ul>
<li><a href="#org8fe40b3">Vertico</a></li>
<li><a href="#orgbb4ebd8">Marginalia</a></li>
</ul>
</li>
<li><a href="#orga0d6aec"><span class="todo WIP">WIP</span> Mode line</a></li>
<li><a href="#orgc787fdc">Motion</a>
<ul>
<li><a href="#org2a7cada">Avy</a></li>
<li><a href="#orga7497c6">Nav-flash</a></li>
</ul>
</li>
<li><a href="#org4ca195b"><span class="todo WIP">WIP</span> Version control</a>
<ul>
<li><a href="#org278ef0a">Magit</a></li>
</ul>
</li>
<li><a href="#org8291aa4"><span class="todo TODO">TODO</span> Search</a></li>
<li><a href="#org8e46fc1">Misc. packages</a>
<ul>
<li><a href="#org66e8d07">Try</a></li>
<li><a href="#orgda57f17">Switch-window</a></li>
<li><a href="#org93621ef">Solaire mode</a></li>
<li><a href="#org702f042">Bufler</a></li>
<li><a href="#org344fae0"><span class="todo WIP">WIP</span> SVG tag mode</a></li>
<li><a href="#org6a88ad8">Format-all</a></li>
<li><a href="#org125a2e3">Flycheck</a></li>
</ul>
</li>
<li><a href="#orgc244a81">Major Modes</a>
<ul>
<li><a href="#orgcdc7258">Treesit-auto</a></li>
<li><a href="#orgd781ecf"><span class="todo WIP">WIP</span> English</a></li>
<li><a href="#org6b31f77">Emacs Lisp</a></li>
<li><a href="#orgeb17879">Org</a></li>
<li><a href="#orgce2e38a">Nix</a></li>
<li><a href="#orgbb02dc1">Shell script</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd4e0831" class="outline-2">
<h2 id="orgd4e0831">About</h2>
<div class="outline-text-2" id="text-orgd4e0831">
<p>
This is my Emacs configuration. <b>If you want to try it for yourself, <a href="#org93065cc">click here</a>.</b>
</p>
</div>

<div id="outline-container-orgd6dade7" class="outline-3">
<h3 id="orgd6dade7">Tangling</h3>
<div class="outline-text-3" id="text-orgd6dade7">
<p>
This file is not tangled using <code>org-babel-table</code>. Instead, it's
tangled using a bare-bones implementation in <a href="util/tangle.py"><code>util/tangle.py</code></a>, and
thus no fancy tangle features are supported. The <code>header-args</code>
property at the top of the file is not even parsed, it's only there to
maintain compatibility with other tangle implementations.
</p>
</div>
</div>

<div id="outline-container-org114669d" class="outline-3">
<h3 id="org114669d">Substitution</h3>
<div class="outline-text-3" id="text-org114669d">
<p>
The function <code>getnix</code> is used to get a variable from the Nix flake,
sort of like <code>getenv</code> but not exactly. It isn't actually a function
that exists. Instead, <a href="util/substitute.py"><code>util/substitute.py</code></a> is used to substitute all
instances of <code>(getnix "variableName")</code> with the appropriate Elisp
literal.
</p>
</div>
</div>

<div id="outline-container-orgfc9220d" class="outline-3">
<h3 id="orgfc9220d">Tags in comments</h3>
<div class="outline-text-3" id="text-orgfc9220d">
<p>
While reading this document you may see what look to be XML tags,
e.g.:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">defun</span> <span style="color: #8aadf4;">something-spanning-multiple-src-blocks</span> ()
  (beginning-of-the-defun))
<span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;defun&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (middle-of-the-defun)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (end-of-the-defun)) <span style="color: #6e738d;">; </span><span style="color: #6e738d;">&lt;-- closes the defun</span>
<span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;/defun&gt;</span>
</pre>
</div>

<p>
These tags are not parsed. They are only used to indicate to the
reader that code in the same scope may be spread across multiple src
blocks.
</p>
</div>
</div>
</div>

<div id="outline-container-org93065cc" class="outline-2">
<h2 id="org93065cc">Try it yourself</h2>
<div class="outline-text-2" id="text-org93065cc">
</div>
<div id="outline-container-org2cad4ed" class="outline-3">
<h3 id="org2cad4ed">Warning</h3>
<div class="outline-text-3" id="text-org2cad4ed">
<p>
Back up your <code>.emacs.d</code> directory if you already have a configuration
you care about. I don't <i>think</i> that this will affect it, but back it
up anyway just to be safe.
</p>
</div>
</div>

<div id="outline-container-orga7c30c9" class="outline-3">
<h3 id="orga7c30c9">Instructions</h3>
<div class="outline-text-3" id="text-orga7c30c9">
<p>
If you don't have Nix installed, <a href="https://nixos.org/download.html">click here</a>.
</p>

<p>
If you have the experimental features <a href="https://nixos.wiki/wiki/Nix_command">nix-command</a> and <a href="https://nixos.wiki/wiki/Flakes">flakes</a> enabled:
</p>

<div class="org-src-container">
<pre class="src src-shell">nix run github:fr33zing/fr33macs
</pre>
</div>

<p>
If you don't have them enabled but you want to enable them, <a href="https://nixos.wiki/wiki/Flakes#Enable_flakes">click here</a>.
</p>

<div class="org-src-container">
<pre class="src src-shell">nix --experimental-features <span style="color: #a6da95;">'nix-command flakes'</span> run github:fr33zing/fr33macs
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc2a9f28" class="outline-2">
<h2 id="orgc2a9f28">Basic setup</h2>
<div class="outline-text-2" id="text-orgc2a9f28">
<p>
Disable unwanted UI elements and startup messages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(<span style="color: #c6a0f6;">setq</span> inhibit-startup-message t
      use-dialog-box nil)
</pre>
</div>

<p>
Enable some things which should probably be default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">setq</span> require-final-newline t)
(<span style="color: #c6a0f6;">setq</span> frame-inhibit-implied-resize t)
(global-hl-line-mode)
</pre>
</div>

<p>
Enable relative line numbers globally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">setq</span> display-line-numbers-type <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">relative</span>)
(global-display-line-numbers-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ffc75c" class="outline-2">
<h2 id="org6ffc75c">Theme</h2>
<div class="outline-text-2" id="text-org6ffc75c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">custom-theme-load-path</span> (getnix <span style="color: #a6da95;">"themeDir"</span>))
(load-theme <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">catppuccin</span> t)
(<span style="color: #c6a0f6;">setq</span> catppuccin-flavor (getnix <span style="color: #a6da95;">"themeVariant"</span>))
(catppuccin-reload)
</pre>
</div>
</div>

<div id="outline-container-org944b0c2" class="outline-3">
<h3 id="org944b0c2">Variable definitions</h3>
<div class="outline-text-3" id="text-org944b0c2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">defvar</span> <span style="color: #cad3f5;">my:cursor-color</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">sapphire</span>)
  <span style="color: #6e738d;">"Default cursor color."</span>)

(<span style="color: #c6a0f6;">defvar</span> <span style="color: #cad3f5;">my:switch-window-cursor-color</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">red</span>)
  <span style="color: #6e738d;">"Cursor color when switching windows."</span>)

(<span style="color: #c6a0f6;">defvar</span> <span style="color: #cad3f5;">my:code-color</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">text</span>)
  <span style="color: #6e738d;">"Default color for text that is considered code."</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga217aaa" class="outline-3">
<h3 id="orga217aaa">Customization</h3>
<div class="outline-text-3" id="text-orga217aaa">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">default</span> t <span style="color: #ed8796;">:font</span> (getnix <span style="color: #a6da95;">"font"</span>))

(set-cursor-color my:cursor-color)
(set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">region</span> nil
                    <span style="color: #ed8796;">:background</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">surface2</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbf4849d" class="outline-2">
<h2 id="orgbf4849d">Libraries</h2>
<div class="outline-text-2" id="text-orgbf4849d">
</div>
<div id="outline-container-orgf5ab9f5" class="outline-3">
<h3 id="orgf5ab9f5">Dash</h3>
<div class="outline-text-3" id="text-orgf5ab9f5">
<p>
Dash is a library for dealing with lists.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">dash</span> <span style="color: #ed8796;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org47bcd98" class="outline-3">
<h3 id="org47bcd98">Map</h3>
<div class="outline-text-3" id="text-org47bcd98">
<p>
Map provides generic map-manipulation functions that work on alists,
plists, hash-tables, and arrays.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">map</span>)
</pre>
</div>
</div>
</div>
