config.org
* Backups

Prevent clobbering symlinks.

#+BEGIN_SRC emacs-lisp
(setq backup-by-copying t)
#+END_SRC

Use versioned backups.

#+BEGIN_SRC emacs-lisp
(setq version-control t)
#+END_SRC

Prevent backup files from being littered all over the place.

#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist
      '(("." . "~/.emacs-backups/")))
#+END_SRC

Delete excess backup versions silently.

#+BEGIN_SRC emacs-lisp
(setq delete-old-versions t  
      kept-new-versions 6
      kept-old-versions 2)
#+END_SRC

* Key bindings
** Hydras

Hydra is used to create action menus. I've chosen to use hydras as the
foundation for my custom keybind scheme to improve discoverability and
reduce cognitive load.

#+BEGIN_SRC emacs-lisp
(use-package pretty-hydra
  :ensure t
  :config
  ;; <config>
#+END_SRC

*Notice*: Not all hydras are defined in this section. Other sections
that define hydra(s):

- [[*Avy][Motion > Avy]]
- [[*Org][Languages > Org]]

*** File

#+BEGIN_SRC emacs-lisp
  (pretty-hydra-define hydra:file
    (:exit t :idle 0.25)
    ("Switch"
     (("f" find-file "Find file"))))
#+END_SRC

*** Buffer

#+BEGIN_SRC emacs-lisp
  (defun my:last-buffer ()
    (interactive)
    (switch-to-buffer (other-buffer (current-buffer) 1)))

  (pretty-hydra-define hydra:buffer
    (:exit t :idle 0.25)
    ("Switch"
     (("b" bufler-switch-buffer "Quick switch")
      ("i" bufler-list          "List buffers")
      ("]" next-buffer          "Next buffer"     :exit nil)
      ("[" previous-buffer      "Previous buffer" :exit nil)
      ("l" my:last-buffer       "Last buffer"))
     "Actions"
     (("s" save-buffer         "Save buffer")
      ("k" kill-current-buffer "Kill buffer")
      ("K" kill-buffer         "Kill other buffer")
      ("r" revert-buffer       "Revert current buffer")
      ("R" rename-buffer       "Rename current buffer"))))
#+END_SRC

*** Window

#+BEGIN_SRC emacs-lisp
  (pretty-hydra-define hydra:window
    (:exit t :idle 0.25) 
    ("Switch"
     (("w" my:switch-window "Quick switch"))
     "Actions"
     (("k" delete-window             "Kill window")
      ("K" switch-window-then-delete "Kill other window")
      ("s" evil-window-new           "Split window horizontally")
      ("v" evil-window-vnew          "Split window vertically"))))
#+END_SRC

*** Leader key

#+BEGIN_SRC emacs-lisp
  (pretty-hydra-define hydra:leader
    (:exit t :idle 0.25)
    ("Hydra"
     (("f" hydra:file/body   "File")
      ("b" hydra:buffer/body "Buffer")
      ("w" hydra:window/body "Window")
      ("a" hydra:avy/body    "Avy")
      ("o" hydra:org/body    "Org"))
     "Shortcut"
     (("s" save-buffer            "Save buffer")
      ("q" save-buffer-kill-emacs "Quit")))))
;; </config>
#+END_SRC

** General

General provides a convenient way to bind keys.

#+BEGIN_SRC emacs-lisp
(use-package general
  :ensure t
  :init
  (setq general-override-states
        '(insert emacs hybrid normal visual motion operator replace))
  :config
  ;; <config>
#+END_SRC

Use escape to close temporary windows.

#+BEGIN_SRC emacs-lisp
  (general-define-key
    :keymaps 'minibuffer-mode-map
    (kbd "<escape>") 'abort-minibuffers)

  (general-define-key
    :states '(normal)
    :keymaps 'override
    (kbd "<escape>") 'my:delete-next-temporary-window)
#+END_SRC

Use spacebar to open the [[*Leader key][Leader key hydra]].

#+BEGIN_SRC emacs-lisp
  (general-define-key
    :states '(normal visual motion)
    :keymaps 'override
    "SPC" 'hydra:leader/body))
;; </config>
#+END_SRC

** Which-key

Which-key shows all the possible completions of a partially-input
keybind.

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :config
  (which-key-mode))
#+END_SRC

