index.html

<div id="outline-container-org82673f9" class="outline-2">
<h2 id="org82673f9">Backups</h2>
<div class="outline-text-2" id="text-org82673f9">
<p>
Prevent clobbering symlinks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">setq</span> backup-by-copying t)
</pre>
</div>

<p>
Use versioned backups.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">setq</span> version-control t)
</pre>
</div>

<p>
Prevent backup files from being littered all over the place.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">setq</span> backup-directory-alist
      <span style="color: #c6a0f6;">'</span>((<span style="color: #a6da95;">"."</span> . <span style="color: #a6da95;">"~/.emacs-backups/"</span>)))
</pre>
</div>

<p>
Delete excess backup versions silently.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">setq</span> delete-old-versions t  
      kept-new-versions 6
      kept-old-versions 2)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f535ef" class="outline-2">
<h2 id="org6f535ef">Key bindings</h2>
<div class="outline-text-2" id="text-org6f535ef">
</div>
<div id="outline-container-org17ac5ee" class="outline-3">
<h3 id="org17ac5ee">Hydras</h3>
<div class="outline-text-3" id="text-org17ac5ee">
<p>
Pretty-hydra is used to create action menus. I've chosen to use hydras
as the foundation for my custom keybind scheme to improve
discoverability and reduce cognitive load.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">pretty-hydra</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:config</span>
  (set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">hydra-face-red</span> nil
    <span style="color: #ed8796;">:foreground</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">red</span>))
  (set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">hydra-face-blue</span> nil
    <span style="color: #ed8796;">:foreground</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">sapphire</span>))
  (set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">hydra-face-pink</span> nil
    <span style="color: #ed8796;">:foreground</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">pink</span>))
  (set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">hydra-face-teal</span> nil
    <span style="color: #ed8796;">:foreground</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">teal</span>))
  (set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">hydra-face-amaranth</span> nil
    <span style="color: #ed8796;">:foreground</span> (catppuccin-get-color <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">mauve</span>))
    <span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;config&gt;</span>
</pre>
</div>

<p>
<b>Notice</b>: Not all hydras are defined in this section. Other sections
that define hydra(s):
</p>

<ul class="org-ul">
<li><a href="#org2a7cada">Motion &gt; Avy</a></li>
<li><a href="#orgeb17879">Languages &gt; Org</a></li>
</ul>
</div>

<div id="outline-container-org0d03cc4" class="outline-4">
<h4 id="org0d03cc4">File</h4>
<div class="outline-text-4" id="text-org0d03cc4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #c6a0f6;">pretty-hydra-define</span> hydra:file
    (<span style="color: #ed8796;">:exit</span> t <span style="color: #ed8796;">:idle</span> 0.25)
    (<span style="color: #a6da95;">"Switch"</span>
     ((<span style="color: #a6da95;">"f"</span> find-file <span style="color: #a6da95;">"Find file"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf66e921" class="outline-4">
<h4 id="orgf66e921">Buffer</h4>
<div class="outline-text-4" id="text-orgf66e921">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #c6a0f6;">defun</span> <span style="color: #8aadf4;">my:last-buffer</span> ()
    (<span style="color: #c6a0f6;">interactive</span>)
    (switch-to-buffer (other-buffer (current-buffer) 1)))

  (<span style="color: #c6a0f6;">pretty-hydra-define</span> hydra:buffer
    (<span style="color: #ed8796;">:exit</span> t <span style="color: #ed8796;">:idle</span> 0.25)
    (<span style="color: #a6da95;">"Switch"</span>
     ((<span style="color: #a6da95;">"b"</span> bufler-switch-buffer <span style="color: #a6da95;">"Quick switch"</span>)
      (<span style="color: #a6da95;">"i"</span> bufler-list          <span style="color: #a6da95;">"List buffers"</span>)
      (<span style="color: #a6da95;">"]"</span> next-buffer          <span style="color: #a6da95;">"Next buffer"</span>     <span style="color: #ed8796;">:exit</span> nil)
      (<span style="color: #a6da95;">"["</span> previous-buffer      <span style="color: #a6da95;">"Previous buffer"</span> <span style="color: #ed8796;">:exit</span> nil)
      (<span style="color: #a6da95;">"l"</span> my:last-buffer       <span style="color: #a6da95;">"Last buffer"</span>))
     <span style="color: #a6da95;">"Actions"</span>
     ((<span style="color: #a6da95;">"s"</span> save-buffer         <span style="color: #a6da95;">"Save buffer"</span>)
      (<span style="color: #a6da95;">"k"</span> kill-current-buffer <span style="color: #a6da95;">"Kill buffer"</span>)
      (<span style="color: #a6da95;">"K"</span> kill-buffer         <span style="color: #a6da95;">"Kill other buffer"</span>)
      (<span style="color: #a6da95;">"r"</span> revert-buffer       <span style="color: #a6da95;">"Revert current buffer"</span>)
      (<span style="color: #a6da95;">"R"</span> rename-buffer       <span style="color: #a6da95;">"Rename current buffer"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org312c4cf" class="outline-4">
<h4 id="org312c4cf">Window</h4>
<div class="outline-text-4" id="text-org312c4cf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #c6a0f6;">pretty-hydra-define</span> hydra:window
    (<span style="color: #ed8796;">:exit</span> t <span style="color: #ed8796;">:idle</span> 0.25) 
    (<span style="color: #a6da95;">"Switch"</span>
     ((<span style="color: #a6da95;">"w"</span> my:switch-window <span style="color: #a6da95;">"Quick switch"</span>))
     <span style="color: #a6da95;">"Actions"</span>
     ((<span style="color: #a6da95;">"k"</span> delete-window             <span style="color: #a6da95;">"Kill window"</span>)
      (<span style="color: #a6da95;">"K"</span> switch-window-then-delete <span style="color: #a6da95;">"Kill other window"</span>)
      (<span style="color: #a6da95;">"s"</span> evil-window-new           <span style="color: #a6da95;">"Split window horizontally"</span>)
      (<span style="color: #a6da95;">"v"</span> evil-window-vnew          <span style="color: #a6da95;">"Split window vertically"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3883cb" class="outline-4">
<h4 id="orgb3883cb">Leader key</h4>
<div class="outline-text-4" id="text-orgb3883cb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #c6a0f6;">pretty-hydra-define</span> hydra:leader
    (<span style="color: #ed8796;">:exit</span> t <span style="color: #ed8796;">:idle</span> 0.25)
    (<span style="color: #a6da95;">"Hydra"</span>
     ((<span style="color: #a6da95;">"f"</span> hydra:file/body   <span style="color: #a6da95;">"File"</span>)
      (<span style="color: #a6da95;">"b"</span> hydra:buffer/body <span style="color: #a6da95;">"Buffer"</span>)
      (<span style="color: #a6da95;">"w"</span> hydra:window/body <span style="color: #a6da95;">"Window"</span>)
      (<span style="color: #a6da95;">"a"</span> hydra:avy/body    <span style="color: #a6da95;">"Avy"</span>)
      (<span style="color: #a6da95;">"o"</span> hydra:org/body    <span style="color: #a6da95;">"Org"</span>))
     <span style="color: #a6da95;">"Shortcut"</span>
     ((<span style="color: #a6da95;">"s"</span> save-buffer            <span style="color: #a6da95;">"Save buffer"</span>)
      (<span style="color: #a6da95;">"q"</span> save-buffer-kill-emacs <span style="color: #a6da95;">"Quit"</span>)))))
<span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;/config&gt;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org29fc501" class="outline-3">
<h3 id="org29fc501">General</h3>
<div class="outline-text-3" id="text-org29fc501">
<p>
General provides a convenient way to bind keys.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">general</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:init</span>
  (<span style="color: #c6a0f6;">setq</span> general-override-states
        <span style="color: #c6a0f6;">'</span>(insert emacs hybrid normal visual motion operator replace))
  <span style="color: #ed8796;">:config</span>
  <span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;config&gt;</span>
</pre>
</div>

<p>
Use escape to close temporary windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (general-define-key
    <span style="color: #ed8796;">:keymaps</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">minibuffer-mode-map</span>
    (kbd <span style="color: #a6da95;">"&lt;escape&gt;"</span>) <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">abort-minibuffers</span>)

  (general-define-key
    <span style="color: #ed8796;">:states</span> <span style="color: #c6a0f6;">'</span>(normal)
    <span style="color: #ed8796;">:keymaps</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">override</span>
    (kbd <span style="color: #a6da95;">"&lt;escape&gt;"</span>) <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">my:delete-next-temporary-window</span>)
</pre>
</div>

<p>
Use spacebar to open the <a href="#orgb3883cb">Leader key hydra</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (general-define-key
    <span style="color: #ed8796;">:states</span> <span style="color: #c6a0f6;">'</span>(normal visual motion)
    <span style="color: #ed8796;">:keymaps</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">override</span>
    <span style="color: #a6da95;">"SPC"</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">hydra:leader/body</span>))
<span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;/config&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org567491b" class="outline-3">
<h3 id="org567491b">Which-key</h3>
<div class="outline-text-3" id="text-org567491b">
<p>
Which-key shows all the possible completions of a partially-input
keybind.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">which-key</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:config</span>
  (which-key-mode))
</pre>
</div>
</div>
</div>
</div>
