config.org
* Evil

Evil (extensible vi layer) emulates the main features of Vim.

#+BEGIN_SRC emacs-lisp
(use-package evil
  :ensure t
  :init
  (setq evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-undo-system 'undo-redo)
  :config
  (evil-mode 1))
#+END_SRC

Evil collection is a collection of Evil bindings for the parts of
Emacs that Evil does not cover properly by default.

#+BEGIN_SRC emacs-lisp
(use-package evil-collection
  :ensure t
  :after evil
  :custom
  (evil-collection-want-unimpaired-p nil)
  :init
  (evil-collection-init))
#+END_SRC

* Minibuffer
** Vertico

Vertico is a minibuffer completion interface.

#+BEGIN_SRC emacs-lisp
(use-package vertico
  :ensure t
  :init
  (vertico-mode)
  :config
  (setq vertico-cycle t)
  :bind (:map vertico-map
         ("C-j" . vertico-next)
         ("C-k" . vertico-previous)
         ("TAB" . vertico-insert)))
#+END_SRC

Use the ~orderless~ completion style.

#+BEGIN_SRC emacs-lisp
(use-package orderless
  :ensure t
  :init
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+END_SRC

Persist history over Emacs restarts. Vertico sorts by history
position.

#+BEGIN_SRC emacs-lisp
(use-package savehist
  :init
  (savehist-mode))
#+END_SRC

Do not allow the cursor in the minibuffer prompt.

#+BEGIN_SRC emacs-lisp
(use-package emacs
  :init
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  ;; <init>
#+END_SRC

Hide commands in M-x which do not work in the current mode. Vertico
commands are hidden in normal buffers.

#+BEGIN_SRC emacs-lisp
  (setq read-extended-command-predicate
        #'command-completion-default-include-p))
;; </init>
#+END_SRC

** Marginalia

Marginalia adds helpful information to entries in Vertico. For
example, if you type ~M-x~, Vertico will open a list of usable
commands. Marginalia will add each command's description next to it.

#+BEGIN_SRC emacs-lisp
(use-package marginalia
  :ensure t
  :init
  (marginalia-mode))
#+END_SRC
* WIP Mode line

Warning: Not tangled

#+BEGIN_SRC emacs-lisp :tangle no
(set-face-attribute 'mode-line nil :height 1.0)

(defun my:mode-line-major-mode ()
  (propertize "-%m-" 'face '(:foreground "red")))

(setq-default mode-line-format '(
    (:eval (my:mode-line-major-mode))
))
#+END_SRC

* Motion
** Avy

Avy is a convenient tool to jump around and perform some actions based
on a short filter.

#+BEGIN_SRC emacs-lisp
(use-package avy
  :ensure t
  :after evil
  :config
  (setq avy-timeout-seconds 0.375)
  (advice-add 'avy-process :after #'my:advice:nav-flash-show))

(pretty-hydra-define hydra:avy
  (:exit t :idle 0.25) 
  ("Filter"
   (("a" avy-goto-char-timer           "Char(s) with timer")
    ("c" avy-goto-char-in-line         "Char in line")
    ("w" avy-goto-word-1               "Word by first char")
    ("s" avy-goto-symbol-1             "Symbol by first char")
    ("h" avy-org-goto-heading-timer    "Org heading with timer"))
   "Repeat"
   ((";" avy-next                      "Next match"     :exit nil)
    ("," avy-previous                  "Previous match" :exit nil)
    ("p" avy-pop-mark                  "Pop mark"       :exit nil))
   "Actions"
   (("y" avy-copy-line                 "Copy line")
    ("Y" avy-copy-region               "Copy region")
    ("m" avy-move-line                 "Move line")
    ("M" avy-move-region               "Move region")
    ("d" avy-kill-ring-save-whole-line "Delete line")
    ("D" avy-kill-ring-save-region     "Delete region"))))
#+END_SRC

** Nav-flash

Nav-flash makes it easier to track the cursor across large movements
by flashing the current line.

#+BEGIN_SRC emacs-lisp
(use-package nav-flash
  :ensure t
  :config
  (setq nav-flash-delay 0.125)
  (set-face-attribute 'nav-flash-face nil
    :background (face-attribute 'cursor :background)
    :foreground (face-attribute 'default :background))

    (--map (advice-add it :after #'my:advice:nav-flash-show) '(
      evil-scroll-up
      evil-scroll-down)))
#+END_SRC

* WIP Version control
** Magit

#+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t)
#+END_SRC

* TODO Search
* Misc. packages
