index.html

<div id="outline-container-orgbd34cd5" class="outline-2">
<h2 id="orgbd34cd5">Evil</h2>
<div class="outline-text-2" id="text-orgbd34cd5">
<p>
Evil (extensible vi layer) emulates the main features of Vim.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">evil</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:init</span>
  (<span style="color: #c6a0f6;">setq</span> evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-undo-system <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">undo-redo</span>)
  <span style="color: #ed8796;">:config</span>
  (evil-mode 1))
</pre>
</div>

<p>
Evil collection is a collection of Evil bindings for the parts of
Emacs that Evil does not cover properly by default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">evil-collection</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:after</span> evil
  <span style="color: #ed8796;">:custom</span>
  (evil-collection-want-unimpaired-p nil)
  <span style="color: #ed8796;">:init</span>
  (evil-collection-init))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9ff19d" class="outline-2">
<h2 id="orgf9ff19d">Minibuffer</h2>
<div class="outline-text-2" id="text-orgf9ff19d">
</div>
<div id="outline-container-org8fe40b3" class="outline-3">
<h3 id="org8fe40b3">Vertico</h3>
<div class="outline-text-3" id="text-org8fe40b3">
<p>
Vertico is a minibuffer completion interface.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">vertico</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:init</span>
  (vertico-mode)
  <span style="color: #ed8796;">:config</span>
  (<span style="color: #c6a0f6;">setq</span> vertico-cycle t)
  <span style="color: #ed8796;">:bind</span> (<span style="color: #ed8796;">:map</span> vertico-map
         (<span style="color: #a6da95;">"C-j"</span> . vertico-next)
         (<span style="color: #a6da95;">"C-k"</span> . vertico-previous)
         (<span style="color: #a6da95;">"TAB"</span> . vertico-insert)))
</pre>
</div>

<p>
Use the <code>orderless</code> completion style.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">orderless</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:init</span>
  (<span style="color: #c6a0f6;">setq</span> completion-styles <span style="color: #c6a0f6;">'</span>(orderless basic)
        completion-category-defaults nil
        completion-category-overrides <span style="color: #c6a0f6;">'</span>((file (styles partial-completion)))))
</pre>
</div>

<p>
Persist history over Emacs restarts. Vertico sorts by history
position.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">savehist</span>
  <span style="color: #ed8796;">:init</span>
  (savehist-mode))
</pre>
</div>

<p>
Do not allow the cursor in the minibuffer prompt.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">emacs</span>
  <span style="color: #ed8796;">:init</span>
  (<span style="color: #c6a0f6;">setq</span> minibuffer-prompt-properties
        <span style="color: #c6a0f6;">'</span>(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">minibuffer-setup-hook</span> <span style="color: #c6a0f6;">#'</span><span style="color: #f5a97f;">cursor-intangible-mode</span>)
  <span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;init&gt;</span>
</pre>
</div>

<p>
Hide commands in M-x which do not work in the current mode. Vertico
commands are hidden in normal buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #c6a0f6;">setq</span> read-extended-command-predicate
        <span style="color: #c6a0f6;">#'</span><span style="color: #f5a97f;">command-completion-default-include-p</span>))
<span style="color: #6e738d;">;; </span><span style="color: #6e738d;">&lt;/init&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb4ebd8" class="outline-3">
<h3 id="orgbb4ebd8">Marginalia</h3>
<div class="outline-text-3" id="text-orgbb4ebd8">
<p>
Marginalia adds helpful information to entries in Vertico. For
example, if you type <code>M-x</code>, Vertico will open a list of usable
commands. Marginalia will add each command's description next to it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">marginalia</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:init</span>
  (marginalia-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga0d6aec" class="outline-2">
<h2 id="orga0d6aec"><span class="todo WIP">WIP</span> Mode line</h2>
<div class="outline-text-2" id="text-orga0d6aec">
<p>
Warning: Not tangled
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">mode-line</span> nil <span style="color: #ed8796;">:height</span> 1.0)

(<span style="color: #c6a0f6;">defun</span> <span style="color: #8aadf4;">my:mode-line-major-mode</span> ()
  (propertize <span style="color: #a6da95;">"-%m-"</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">face</span> <span style="color: #c6a0f6;">'</span>(<span style="color: #ed8796;">:foreground</span> <span style="color: #a6da95;">"red"</span>)))

(<span style="color: #c6a0f6;">setq-default</span> mode-line-format <span style="color: #c6a0f6;">'</span>(
    (<span style="color: #ed8796;">:eval</span> (my:mode-line-major-mode))
))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc787fdc" class="outline-2">
<h2 id="orgc787fdc">Motion</h2>
<div class="outline-text-2" id="text-orgc787fdc">
</div>
<div id="outline-container-org2a7cada" class="outline-3">
<h3 id="org2a7cada">Avy</h3>
<div class="outline-text-3" id="text-org2a7cada">
<p>
Avy is a convenient tool to jump around and perform some actions based
on a short filter.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">avy</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:after</span> evil
  <span style="color: #ed8796;">:config</span>
  (<span style="color: #c6a0f6;">setq</span> avy-timeout-seconds 0.375)
  (advice-add <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">avy-process</span> <span style="color: #ed8796;">:after</span> <span style="color: #c6a0f6;">#'</span><span style="color: #f5a97f;">my:advice:nav-flash-show</span>))

(<span style="color: #c6a0f6;">pretty-hydra-define</span> hydra:avy
  (<span style="color: #ed8796;">:exit</span> t <span style="color: #ed8796;">:idle</span> 0.25) 
  (<span style="color: #a6da95;">"Filter"</span>
   ((<span style="color: #a6da95;">"a"</span> avy-goto-char-timer           <span style="color: #a6da95;">"Char(s) with timer"</span>)
    (<span style="color: #a6da95;">"c"</span> avy-goto-char-in-line         <span style="color: #a6da95;">"Char in line"</span>)
    (<span style="color: #a6da95;">"w"</span> avy-goto-word-1               <span style="color: #a6da95;">"Word by first char"</span>)
    (<span style="color: #a6da95;">"s"</span> avy-goto-symbol-1             <span style="color: #a6da95;">"Symbol by first char"</span>)
    (<span style="color: #a6da95;">"h"</span> avy-org-goto-heading-timer    <span style="color: #a6da95;">"Org heading with timer"</span>))
   <span style="color: #a6da95;">"Repeat"</span>
   ((<span style="color: #a6da95;">";"</span> avy-next                      <span style="color: #a6da95;">"Next match"</span>     <span style="color: #ed8796;">:exit</span> nil)
    (<span style="color: #a6da95;">","</span> avy-previous                  <span style="color: #a6da95;">"Previous match"</span> <span style="color: #ed8796;">:exit</span> nil)
    (<span style="color: #a6da95;">"p"</span> avy-pop-mark                  <span style="color: #a6da95;">"Pop mark"</span>       <span style="color: #ed8796;">:exit</span> nil))
   <span style="color: #a6da95;">"Actions"</span>
   ((<span style="color: #a6da95;">"y"</span> avy-copy-line                 <span style="color: #a6da95;">"Copy line"</span>)
    (<span style="color: #a6da95;">"Y"</span> avy-copy-region               <span style="color: #a6da95;">"Copy region"</span>)
    (<span style="color: #a6da95;">"m"</span> avy-move-line                 <span style="color: #a6da95;">"Move line"</span>)
    (<span style="color: #a6da95;">"M"</span> avy-move-region               <span style="color: #a6da95;">"Move region"</span>)
    (<span style="color: #a6da95;">"d"</span> avy-kill-ring-save-whole-line <span style="color: #a6da95;">"Delete line"</span>)
    (<span style="color: #a6da95;">"D"</span> avy-kill-ring-save-region     <span style="color: #a6da95;">"Delete region"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga7497c6" class="outline-3">
<h3 id="orga7497c6">Nav-flash</h3>
<div class="outline-text-3" id="text-orga7497c6">
<p>
Nav-flash makes it easier to track the cursor across large movements
by flashing the current line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">nav-flash</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:config</span>
  (<span style="color: #c6a0f6;">setq</span> nav-flash-delay 0.125)
  (set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">nav-flash-face</span> nil
    <span style="color: #ed8796;">:background</span> (face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">cursor</span> <span style="color: #ed8796;">:background</span>)
    <span style="color: #ed8796;">:foreground</span> (face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">default</span> <span style="color: #ed8796;">:background</span>))

    (<span style="color: #c6a0f6;">--map</span> (advice-add it <span style="color: #ed8796;">:after</span> <span style="color: #c6a0f6;">#'</span><span style="color: #f5a97f;">my:advice:nav-flash-show</span>) <span style="color: #c6a0f6;">'</span>(
      evil-scroll-up
      evil-scroll-down)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4ca195b" class="outline-2">
<h2 id="org4ca195b"><span class="todo WIP">WIP</span> Version control</h2>
<div class="outline-text-2" id="text-org4ca195b">
</div>
<div id="outline-container-org278ef0a" class="outline-3">
<h3 id="org278ef0a">Magit</h3>
<div class="outline-text-3" id="text-org278ef0a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">magit</span>
  <span style="color: #ed8796;">:ensure</span> t)
</pre>
</div>
</div>
</div>
</div>
