config.org
** Try

Try allows you to try Emacs packages without installing them.

#+BEGIN_SRC emacs-lisp
(use-package try :ensure t)
#+END_SRC

** Switch-window

Switch-window provides a nice way to choose which window to switch to
when there are more than two windows. When a switch-window command is
used, a number character appears in the corner of each window. Typing
one of the characters then switches focus to that window.

#+BEGIN_SRC emacs-lisp
(use-package switch-window
  :ensure t
  :init
  :config
  (defun my:switch-window ()
    "Switch window and change cursor color."
    (interactive)
    (set-cursor-color my:switch-window-cursor-color)
    (switch-window))
  (defun my:switch-window-finish-hook ()
    (set-cursor-color my:cursor-color))
  (add-hook 'switch-window-finish-hook #'my:switch-window-finish-hook)

  (setq switch-window-input-style 'minibuffer)
  (set-face-attribute 'switch-window-label nil :height 5.0))
#+END_SRC

** Solaire mode

Solaire mode helps to visually distinguish "real" buffers (code
buffers) from "unreal" buffers (popups, sidebars, log buffers,
terminals, etc) by giving the latter a different background.

#+BEGIN_SRC emacs-lisp
(use-package solaire-mode
  :ensure t
  :after general
  :config
  (solaire-global-mode +1))
#+END_SRC

** Bufler

Bufler is an ibuffer alternative.

#+BEGIN_SRC emacs-lisp
(use-package bufler
  :ensure t
  :after evil
  :config
  (evil-define-key 'motion bufler-list-mode-map
    (kbd "RET") 'bufler-list-buffer-switch
    (kbd "SPC") 'bufler-list-buffer-peek
    (kbd "C-s") 'bufler-list-buffer-save
    "d" 'bufler-list-buffer-kill
    "x" 'bufler-list-buffer-kill))
#+END_SRC

