index.html

<div id="outline-container-org8291aa4" class="outline-2">
<h2 id="org8291aa4"><span class="todo TODO">TODO</span> Search</h2>
</div>
<div id="outline-container-org8e46fc1" class="outline-2">
<h2 id="org8e46fc1">Misc. packages</h2>
<div class="outline-text-2" id="text-org8e46fc1">
</div>
<div id="outline-container-org66e8d07" class="outline-3">
<h3 id="org66e8d07">Try</h3>
<div class="outline-text-3" id="text-org66e8d07">
<p>
Try allows you to try Emacs packages without installing them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">try</span> <span style="color: #ed8796;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda57f17" class="outline-3">
<h3 id="orgda57f17">Switch-window</h3>
<div class="outline-text-3" id="text-orgda57f17">
<p>
Switch-window provides a nice way to choose which window to switch to
when there are more than two windows. When a switch-window command is
used, a number character appears in the corner of each window. Typing
one of the characters then switches focus to that window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">switch-window</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:init</span>
  <span style="color: #ed8796;">:config</span>
  (<span style="color: #c6a0f6;">defun</span> <span style="color: #8aadf4;">my:switch-window</span> ()
    <span style="color: #6e738d;">"Switch window and change cursor color."</span>
    (<span style="color: #c6a0f6;">interactive</span>)
    (set-cursor-color my:switch-window-cursor-color)
    (switch-window))
  (<span style="color: #c6a0f6;">defun</span> <span style="color: #8aadf4;">my:switch-window-finish-hook</span> ()
    (set-cursor-color my:cursor-color))
  (add-hook <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">switch-window-finish-hook</span> <span style="color: #c6a0f6;">#'</span><span style="color: #f5a97f;">my:switch-window-finish-hook</span>)

  (<span style="color: #c6a0f6;">setq</span> switch-window-input-style <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">minibuffer</span>)
  (set-face-attribute <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">switch-window-label</span> nil <span style="color: #ed8796;">:height</span> 5.0))
</pre>
</div>
</div>
</div>

<div id="outline-container-org93621ef" class="outline-3">
<h3 id="org93621ef">Solaire mode</h3>
<div class="outline-text-3" id="text-org93621ef">
<p>
Solaire mode helps to visually distinguish "real" buffers (code
buffers) from "unreal" buffers (popups, sidebars, log buffers,
terminals, etc) by giving the latter a different background.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">solaire-mode</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:after</span> general
  <span style="color: #ed8796;">:config</span>
  (solaire-global-mode +1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org702f042" class="outline-3">
<h3 id="org702f042">Bufler</h3>
<div class="outline-text-3" id="text-org702f042">
<p>
Bufler is an ibuffer alternative.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c6a0f6;">use-package</span> <span style="color: #f5a97f;">bufler</span>
  <span style="color: #ed8796;">:ensure</span> t
  <span style="color: #ed8796;">:after</span> evil
  <span style="color: #ed8796;">:config</span>
  (<span style="color: #c6a0f6;">evil-define-key</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">motion</span> bufler-list-mode-map
    (kbd <span style="color: #a6da95;">"RET"</span>) <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">bufler-list-buffer-switch</span>
    (kbd <span style="color: #a6da95;">"SPC"</span>) <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">bufler-list-buffer-peek</span>
    (kbd <span style="color: #a6da95;">"C-s"</span>) <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">bufler-list-buffer-save</span>
    <span style="color: #a6da95;">"d"</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">bufler-list-buffer-kill</span>
    <span style="color: #a6da95;">"x"</span> <span style="color: #c6a0f6;">'</span><span style="color: #f5a97f;">bufler-list-buffer-kill</span>))
</pre>
</div>
</div>
</div>
